src/test/jmeter/performance-test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group">
        <intProp name="ThreadGroup.num_threads">10</intProp>
        <intProp name="ThreadGroup.ramp_time">5</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">3</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request">
          <stringProp name="HTTPSampler.domain">localhost</stringProp>
          <stringProp name="HTTPSampler.port">9090</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/api/students</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">C:\Users\Daney\OneDrive\Documents\SC_AsSG2\studentrecords\studentrecords\src\test\jmeter\performance-test.jmx</stringProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>
1781999144337,196,HTTP Request,200,,Thread Group 1-1,text,true,,174,128,1,1,http://localhost:9090/api/students,194,0,7
1781999144535,3,HTTP Request,200,,Thread Group 1-1,text,true,,174,128,1,1,http://localhost:9090/api/students,3,0,0
1781999144538,3,HTTP Request,200,,Thread Group 1-1,text,true,,174,128,1,1,http://localhost:9090/api/students,3,0,0
1781999144833,7,HTTP Request,200,,Thread Group 1-2,text,true,,174,128,1,1,http://localhost:9090/api/students,7,0,1
1781999144841,3,HTTP Request,200,,Thread Group 1-2,text,true,,174,128,1,1,http://localhost:9090/api/students,3,0,0
1781999144844,3,HTTP Request,200,,Thread Group 1-2,text,true,,174,128,1,1,http://localhost:9090/api/students,3,0,0
1781999145334,4,HTTP Request,200,,Thread Group 1-3,text,true,,174,128,1,1,http://localhost:9090/api/students,4,0,1
1781999145339,3,HTTP Request,200,,Thread Group 1-3,text,true,,174,128,1,1,http://localhost:9090/api/students,3,0,0
1781999145343,2,HTTP Request,200,,Thread Group 1-3,text,true,,174,128,1,1,http://localhost:9090/api/students,2,0,0
1781999145834,5,HTTP Request,200,,Thread Group 1-4,text,true,,174,128,1,1,http://localhost:9090/api/students,5,0,1
1781999145839,3,HTTP Request,200,,Thread Group 1-4,text,true,,174,128,1,1,http://localhost:9090/api/students,3,0,0
1781999145842,2,HTTP Request,200,,Thread Group 1-4,text,true,,174,128,1,1,http://localhost:9090/api/students,2,0,0
1781999146335,4,HTTP Request,200,,Thread Group 1-5,text,true,,174,128,1,1,http://localhost:9090/api/students,3,0,1
1781999146339,3,HTTP Request,200,,Thread Group 1-5,text,true,,174,128,1,1,http://localhost:9090/api/students,3,0,0
1781999146343,1,HTTP Request,200,,Thread Group 1-5,text,true,,174,128,1,1,http://localhost:9090/api/students,1,0,0
1781999146836,3,HTTP Request,200,,Thread Group 1-6,text,true,,174,128,1,1,http://localhost:9090/api/students,3,0,1
1781999146840,2,HTTP Request,200,,Thread Group 1-6,text,true,,174,128,1,1,http://localhost:9090/api/students,2,0,0
1781999146843,3,HTTP Request,200,,Thread Group 1-6,text,true,,174,128,1,1,http://localhost:9090/api/students,3,0,0
1781999147335,4,HTTP Request,200,,Thread Group 1-7,text,true,,174,128,1,1,http://localhost:9090/api/students,4,0,1
1781999147339,2,HTTP Request,200,,Thread Group 1-7,text,true,,174,128,1,1,http://localhost:9090/api/students,2,0,0
1781999147341,3,HTTP Request,200,,Thread Group 1-7,text,true,,174,128,1,1,http://localhost:9090/api/students,3,0,0
1781999147834,3,HTTP Request,200,,Thread Group 1-8,text,true,,174,128,1,1,http://localhost:9090/api/students,3,0,1
1781999147838,3,HTTP Request,200,,Thread Group 1-8,text,true,,174,128,1,1,http://localhost:9090/api/students,3,0,0
1781999147841,2,HTTP Request,200,,Thread Group 1-8,text,true,,174,128,1,1,http://localhost:9090/api/students,2,0,0
1781999148335,4,HTTP Request,200,,Thread Group 1-9,text,true,,174,128,1,1,http://localhost:9090/api/students,4,0,2
1781999148340,3,HTTP Request,200,,Thread Group 1-9,text,true,,174,128,1,1,http://localhost:9090/api/students,3,0,0
1781999148344,2,HTTP Request,200,,Thread Group 1-9,text,true,,174,128,1,1,http://localhost:9090/api/students,2,0,0
1781999148833,4,HTTP Request,200,,Thread Group 1-10,text,true,,174,128,1,1,http://localhost:9090/api/students,4,0,2
1781999148838,2,HTTP Request,200,,Thread Group 1-10,text,true,,174,128,1,1,http://localhost:9090/api/students,2,0,0
1781999148841,3,HTTP Request,200,,Thread Group 1-10,text,true,,174,128,1,1,http://localhost:9090/api/students,3,0,0